app/controllers/home_controller.rb

SELECT "users".* FROM "users"
---
  def index_autenticado
    @users = User.all