app/controllers/pessoas_controller.rb

SELECT "pessoas".* FROM "pessoas" ORDER BY id DESC LIMIT 50 OFFSET 0
SELECT COUNT(*) FROM "pessoas"
---
  def index
    @pessoas = Pessoa.paginate(:page => params[:page],
                               :per_page => 5,
                               :order => 'id DESC')

SELECT "pessoas".* FROM "pessoas" WHERE "pessoas"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @pessoa = Pessoa.find(params[:id])

SELECT "pessoas".* FROM "pessoas" WHERE "pessoas"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    @pessoa = Pessoa.find(params[:id])

INSERT INTO "pessoas" ("cgf", "cpf_cnpj", "created_at", "data_nascimento", "fantasia", "naturalidade", "nome", "rg", "sexo", "tipo", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @pessoa = Pessoa.new(params[:pessoa])

    respond_to do |format|
      if @pessoa.save

SELECT "pessoas".* FROM "pessoas" WHERE "pessoas"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def update
    @pessoa = Pessoa.find(params[:id])