app/controllers/roles_controller.rb

SELECT "roles".* FROM "roles" ORDER BY id DESC LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "roles"
---
  def index
    authorize! :index, @user, :message => 'Não autorizado como administrador'
    @roles = Role.paginate(:page => params[:page],
                               :per_page => 5,
                               :order => 'id DESC')

SELECT "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT 1  [["id", "3"]]
---
  def show
    authorize! :show, @user, :message => 'Não autorizado como administrador'

    @role = Role.find(params[:id])

INSERT INTO "roles" ("created_at", "name", "resource_id", "resource_type", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Sáb, 08 Set 2012 12:14:04 BRT -03:00], ["name", "operador"], ["resource_id", nil], ["resource_type", nil], ["updated_at", Sáb, 08 Set 2012 12:14:04 BRT -03:00]]
---
  def create
    authorize! :create, @user, :message => 'Não autorizado como administrador'

    @role = Role.new(params[:role])

    respond_to do |format|
      if @role.save

SELECT "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT 1  [["id", "2"]]
DELETE FROM "roles" WHERE "roles"."id" = $1  [["id", 2]]
---
  def destroy
    authorize! :destroy, @user, :message => 'Não autorizado como administrador'

    @role = Role.find(params[:id])
    @role.destroy