app/controllers/users_controller.rb

  def index
    authorize! :index, @user, :message => 'Não autorizado como administrador'
    @users = User.all
---
SELECT "users".* FROM "users"